# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Analyzing Dynamic Task-Based Applications on Hybrid Platforms: An Agile Scripting Approach
#+AUTHOR: Vinícius Garcia Pinto, Luka Stanisic, Arnaud Legrand, Lucas Mello Schnorr, Samuel Thibault, Vincent Danjean

#+STARTUP: overview indent
#+LANGUAGE: en
#+OPTIONS: H:3 creator:nil timestamp:nil skip:nil toc:nil num:t ^:nil ~:~
#+OPTIONS: author:nil title:nil date:nil
#+TAGS: noexport(n) deprecated(d) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

*** Loading libraries
#+name: load_libraries
#+begin_src R :results output :session R3  :noexport:
  # Adding necessary libraries
  library(plyr)
  library(dplyr)
  library(ggplot2)
  library(gtools)
  library(data.table)
  library(gridExtra)
  library(scales)
  library(reshape)
  library(parallel)
  library(RColorBrewer)
  library(lpSolve)
  library(plotly)
  library(Rcpp)
  library(inline)
  library(dtplyr)
  library(grid)
  library(gtable)
  library(knitr)
  library(flexdashboard)
#+end_src

#+RESULTS: load_libraries
: Error in library(dtplyr) : there is no package called ‘dtplyr’
: 
: Attaching package: ‘directlabels’
: 
: The following object is masked from ‘package:reshape’:
: 
:     merge_recurse

**** Original Code
#+name: rawDir12
#+begin_src sh :results output  :var rawPath="./data/chameleon-idcin2-604020/12/" :cache yes :noexport:
    tmpDir=$(mktemp -d)
    echo -n "$tmpDir"
    for file in `find $rawPath -name "SoloStarpuData-*-*org"`;  do 
        filen=`basename $file`
	Sched=`echo $filen | cut -d"-" -f2`;  
	rep=`echo $filen | cut -d"-" -f3`; 
	rep=`echo $rep | cut -d"." -f1`; 
	./get_trace.sh -t $file $tmpDir/paje-$Sched-$rep; 
	grep "nready\|nsubmitted" $tmpDir/paje-$Sched-$rep.trace > $tmpDir/paje-$Sched-$rep-sub-ready-tmp.txt
	tail -n +3 $tmpDir/paje-$Sched-$rep-sub-ready-tmp.txt > $tmpDir/paje-$Sched-$rep-sub-ready.txt
	./get_tasksrec.sh $file $tmpDir/tasks-$Sched-$rep; 
	cat $tmpDir/tasks-$Sched-$rep.rec | sed -n '/^DependsOn\|^JobId/p' | sed  's/JobId: //g' | sed  ':a;N;$!ba;s/\nDependsOn: /,/g' >  $tmpDir/tasks-$Sched-$rep.rec.csv ;
    done
#+end_src

#+RESULTS[fbddb5be2eed2eabd0693e8363071761ed532503]: rawDir12
: /tmp/tmp.cpKKcgEZxq


** Generate pdf pictures
Execute this code (ctrl+c ctrl+c) to generate all the figures used in the paper
#+name: generatepictures
#+begin_src R :results output  :session R3 :var dep=data12 :var dep2=data12tsgpu :var gdep=small1 :var gdep2=small2  :var igdep=small1plotly :var igdep2=small2plotly :var dep3=data60 :var dep4=data60tsgpu :var gdep3=large1 :var gdep4=large2 :var dep5=data5tsgpu :var gdep5=dag5pdf :noexport:
print(sprintf("Figure 1 (pdf version): %s", gdep5))
print(sprintf("Figure 3 (pdf version): %s", gdep))
print(sprintf("Figure 3 (interactively html version): %s", igdep))
print(sprintf("Figure 4 (pdf version): %s", gdep2))
print(sprintf("Figure 4 (interactively html version): %s", igdep2))
print(sprintf("Figure 5 (pdf version): %s", gdep3))
print(sprintf("Figure 6 (pdf version): %s", gdep4))
#+end_src

#+RESULTS:
: [1] "Figure 3 (pdf version): half-size-gantt-dep-outliers.pdf"
: [1] "Figure 4 (interactively html version): half-size-gantt-dep-outliers.html\n"
: [1] "Figure 3 (pdf version): comparison-original-forcing-trsm-syrk-on-gpus.pdf"
: [1] "Figure 4 (interactively html version): comparison-original-forcing-trsm-syrk-on-gpus.html\n"
: [1] "Figure 1 (pdf version): dag-5x5.pdf"


#+name: croppdfs
#+begin_src sh :results output  :var dep=generatepictures :var gdep=pdfcrop(file="./half-size-gantt-dep-outliers.pdf") :var gdep2=pdfcrop(file="./comparison-original-forcing-trsm-syrk-on-gpus.pdf") :var gdep3=pdfcrop(file="./full-size-extended-gantt.pdf") :var gdep4=pdfcrop(file="./comparison-3-sched-original-vs-forcing.pdf")  :var gdep5=pdfcrop(file="./dag-5x5.pdf") :var gdep6=pdfcrop(file="./combo.pdf") :noexport:
   print(sprintf("Figure 1 (cropped pdf version): %s", gdep5))
   print(sprintf("Figure 2 (cropped pdf version): %s", gdep6))
   print(sprintf("Figure 3 (cropped pdf version): %s", gdep))
   print(sprintf("Figure 4 (cropped pdf version): %s", gdep2))
   print(sprintf("Figure 5 (cropped pdf version): %s", gdep3))
   print(sprintf("Figure 6 (cropped pdf version): %s", gdep4))
#+end_src

#+RESULTS:


